In [1]:
#Dataframe de seleccion de datos

In [2]:
import pandas as pd

In [3]:
filas = 'ventas1 ventas2 ventas3'.split()

In [4]:
filas

['ventas1', 'ventas2', 'ventas3']

In [5]:
columnas = 'zonaA zonaB zonaC'.split()

In [6]:
columnas

['zonaA', 'zonaB', 'zonaC']

In [7]:
datos = [[ 120, 340 , 250], [210, 450, 250], [310, 210, 140]]

In [8]:
dataframe = pd.DataFrame(datos, filas, columnas)

In [9]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [10]:
condicion = dataframe > 200

In [13]:
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    340  250.0
ventas2  210.0    450  250.0
ventas3  310.0    210    NaN

In [14]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [15]:
condicion1 = dataframe['zonaA'] > 200

In [16]:
dataframe[condicion1]

         zonaA  zonaB  zonaC
ventas2    210    450    250
ventas3    310    210    140

In [27]:
condiciondoble =  (dataframe['zonaA'] > 200) | (dataframe['zonaB']>300)

In [28]:
dataframe[condiciondoble]

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [30]:
dataframe[condicion][['zonaA', 'zonaC']]

         zonaA  zonaC
ventas1    NaN  250.0
ventas2  210.0  250.0
ventas3  310.0    NaN